/*
  Type: Activity
  Purpose: About the application
  Source Of Trigger: Navigator Window
  Used Xml: about.xml(main)
  Dependency: N/A
  Function Names: N/A
*/
package com.srujanee.sahitya11;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.TextView;

public class AboutActivity extends AppCompatActivity {

    TextView tvAbout;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.about);

        tvAbout = (TextView) findViewById(R.id.tvAbout); //For displaying details about the initiative
        tvAbout.setText("   \"ସୃଜନୀ- ସର୍ଜନାର ଆଦ୍ୟ ବିନ୍ଦୁ\" - ଓଡ଼ିଆ ଲୋକଙ୍କ ପାଇଁ ଏକ ଲେଖିବା ଏବଂ ପଢିବା ସମ୍ବନ୍ଧୀୟ ପ୍ଲାଟଫର୍ମ ଯାହା କିଛି ଉନ୍ନତମାନର ବୈଶିଷ୍ଟ୍ୟ ପ୍ରଦାନ କରୁଅଛି. ଓଡିଶାରେ ପ୍ରଥମ ଥର ପାଇଁ ଏହା ଏକ ଅଭିନବ ପ୍ରୟାସ ଯାହା ଆପଣଙ୍କୁ ଏକ ଡିଜିଟାଲ୍ ମଂଚରେ ନିଜର ଭାବନା ପରିପ୍ରକାଶ କରିବାରେ ସାହାଯ୍ୟ କରିବ | ଏହି ଆପ୍ଲିକେସନ ଆପଣମାନଙ୍କୁ ପ୍ରସିଦ୍ଧ ଲେଖକ ଏବଂ କବିମାନଙ୍କର ପ୍ରାମାଣିକ ଲେଖା ସହିତ ଓଡିଶା ଓ ଓଡ଼ିଆ ଭାଷା ସଂଲଗ୍ନ ବିଭିନ୍ନ ତଥ୍ୟ ଉପସ୍ଥାପିତ କରିବ | ପାଠକ ଏଠାରେ ଓଡ଼ିଶାର ପ୍ରସିଦ୍ଧ କବି ଓ ଲେଖକମାନଙ୍କୁ ଜାଣିବା ସହିତ ତାଙ୍କ ରଚିତ ପୁସ୍ତକ ଓ ଗ୍ରନ୍ଥାବଳୀ ସମ୍ବନ୍ଧୀୟ ତଥ୍ୟ ମଧ୍ୟ ପାଇପାରିବେ |ଏହି ଆପ୍ଲିକେସନର ମୂଳ ଉଦ୍ଦେଶ୍ୟ ଭାଷା ଓ ସଂସ୍କୃତିକୁ ପ୍ରୋତ୍ସାହନ କରିବା ସହିତ ଡିଜିଟାଲ କ୍ଷେତ୍ରରେ ଓଡ଼ିଆ ଭାଷାର ମହତ୍ତ୍ୱକୁ ବୃଦ୍ଧି କରିବା | \n" +
                "\n" +
                "    ଆପ୍ଲିକେସନ ମାଧ୍ୟମରେ ଆମେ ଓଡିଆ ଭାଷା, ଓଡିଶା ଇତିହାସ ଏବଂ ଅନ୍ୟାନ୍ୟ ସୂଚନା ସମ୍ବନ୍ଧରେ ତଥ୍ୟ ପ୍ରଦାନ କରିବାକୁ ସର୍ବଦା ଚେଷ୍ଟା କରିବୁ | ଏହା ଏକ ସ୍ୱତନ୍ତ୍ର ଓଡିଆ ଆପ୍ଲିକେସନ ଯେଉଁଠାରେ କେବଳ ଓଡିଆ ଭାଷା ଓ ତା ସଂଲଗ୍ନ ତଥ୍ୟର ପ୍ରସାରଣ ହୁଏ | ଏହାର ବ୍ୟବହାରକାରୀମାନଙ୍କୁ ଓଡ଼ିଆ ଭାଷା ଉନ୍ମୁଖୀ କରିବା ଏବଂ ଭାଷାର ମହାନତାକୁ ସମସ୍ତଙ୍କ ନିକଟରେ ପହଞ୍ଚେଇବା ଆମର ମୂଳତଃ ପ୍ରୟାସ | ଏଠାରେ ଓଡିଆ ଲେଖକମାନେ ଅନ୍ୟ ଭାଷାର ଲେଖକମାନଙ୍କ ସହିତ ପ୍ରତିଦ୍ୱନ୍ଦ୍ୱିତା କରିବା ଆବଶ୍ୟକ କରନ୍ତି ନାହିଁ | ଏତଦଦ୍ୱାରା ଏଠାରେ ଲେଖକମାନେ ଅଧିକ ଆଦୃତ ସହିତ ଭାଷାଗତ ଅଭିବୃଦ୍ଧି ମଧ୍ୟ ହେଇପାରିବ |\n" +
                "\n" +
                "   ଏହି ଆପ୍ଲିକେସନର ନିର୍ମାଣ ଭାଷା ପ୍ରତି ଶ୍ରଦ୍ଧା ଓ ତାର ପୁନରୁଥାନ ନିମିତ୍ତ ମନୋଭାବ ସହ ଜଡିତ | ଓଡିଶା ତଥା ଓଡ଼ିଆ ଭାଷାର ମାର୍ଜିତ ପରିଭାଷାକୁ ପରିପ୍ରକାଶ କରିବା ପାଇଁ କିଛି ଯୁବାଙ୍କର ଏ ନିଜି ପ୍ରୟାସ. \n" +
                "ନିର୍ମାତାମାନଙ୍କ ପରିଚୟ - \n" +
                "   1- ବିଶ୍ଵଜିତ ଦାସ (Editor)\n" +
                "   2- ଅନୁରାଗ ବେହେରା\n" +
                "   3- ଆକାଶ ରୋଷନ ମୁଣ୍ଡ\n" +
                "\n" +
                "   ଯଦି ଆପଣ ମାନେ ଆପ୍ଲିକେସନଟିକୁ ବ୍ୟବହାର କରୁଛନ୍ତି ଏବଂ ତାହା ସମ୍ବନ୍ଧୀୟ କିଛି ଅସୁବିଧାକୁ ଆମ ନିକଟରେ ଜଣେଇବାକୁ ଚାହୁଁଛନ୍ତି ତେବେ ନିମ୍ନ ପ୍ରଦତ୍ତ ଇ-ମେଲରେ ଆମକୁ ଯୋଗାଯୋଗ କରନ୍ତୁ. \n" +
                "  E-mail Id: srujanee.team@gmail.com\n"+
                "\n" +
                "   ଧନ୍ୟବାଦ");

    }
}